AppBackend/app/controllers/store_routines_controller.rb

  def index
    @store_routines = StoreRoutine.all
---
SELECT "store_routines".* FROM "store_routines"

  def create
    @store_routine = StoreRoutine.new(store_routine_params)

    if @store_routine.save
---
INSERT INTO "store_routines" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "GapFill"], ["description", "Fill the items in the gaps"], ["created_at", "2019-06-24 07:17:01.381875"], ["updated_at", "2019-06-24 07:17:01.381875"]]